[{"name": "Christopher XXXL McNamara", "web_site": "http://www.orbcomm.com", "question_challenge": "Ranking jobs/tasks for implementation. ", "company_name": "ORBCOMM", "question_advice": "Try not to get burnt out, you aren't superman!", "question_fact": "We were the first company to launch sattelites with spacex.", "time": "5", "_format": "plain", "_subject": "Submission to the SEED Project", "title_name": "Director of Applications"}, {"name": "Manish Thakur", "web_site": "https://www.linkedin.com/in/manish-thakur-57925232", "question_challenge": "Greatest challenge is to keep pace with the emerging technologies. ", "company_name": "PRODAPT SOLUTIONS ", "question_advice": " Open to learn new things. ", "question_fact": "As of now no one having sound information about what is happening in sdn/nfv world but people say they are professional in this field. ", "time": "10", "_format": "plain", "_subject": "Submission to the SEED Project", "title_name": "Senior software engineer "}, {"name": "Jonathan Miller Kauffman", "web_site": "https://www.linkedin.com/in/jonathan-miller-kauffman-608b6318/", "question_challenge": "Although there are often significant technical challenges involved with understanding how existing software works or when trying to develop a new feature, the most significant and pervasive challenge is with communication.  Making sure that all stakeholders (the business, analysts, developers, testers, etc.) have the same understanding of the software that is going to be developed is extremely important yet very hard to achieve.  Learning how to identify your assumptions and the assumptions that others may be making will enable you to more effectively communicate and therefore develop software that better meets the needs of users.", "company_name": "Coveros, Inc.", "question_advice": "The ability to learn new skills and technologies is necessary for anyone who plans to enter the software industry.  I recommend that anyone who wants to work in this field develop a habit of continuous learning and practice.  This could be as simple as spending time reading about an area of interest on a daily basis.  What action someone decides to take is less important than the consistency with which they take that action.", "question_fact": "Coveros does not have an office space that they own or rent in which employees can work.  Instead, employees either work at client sites or from their homes.  Whenever we need to meet as a company, we rent meeting spaces.  This reduces the company's fixed costs and allows us to be more profitable.", "time": "23", "_format": "plain", "_subject": "Submission to the SEED Project", "title_name": "Consultant"}, {"name": "James Devine", "web_site": "https://www.linkedin.com/in/jamesdevine", "question_challenge": "Its challenging to stay up to date with technology. AWS is constantly innovating and releasing new products and features.", "company_name": "AWS", "question_advice": "AWS offers a program to on-board solutions architects that aimed at new grads/those with 1-2 year of professional experience. I would be more than happy to help out anyone who is interested and encourage using the AWS Educate program. ", "question_fact": "As a solutions architect supporting the NPO vertical of the Worldwide Public Sector Team I get to work with awesome non-profits and help them make the most of their IT budget through the use of cloud services.", "time": "5", "_format": "plain", "_subject": "Submission to the SEED Project", "title_name": "Solutions Architect"}, {"copyedit": "on", "name": "Katie Beisler", "web_site": "https://www.linkedin.com/in/katherine-beisler-9507b869/", "question_challenge": "Constantly having to learn the latest and greatest.", "time": "15", "_format": "plain", "question_advice": "Start early and start strong by identifying mentors. They can be a professor, a fellow employee, or just a friend in the industry. The more mentors you have and relationships you build, the more you can expect out of your role and job search.", "company_name": "Microsoft", "advancecopy": "on", "question_fact": "Microsoft's ultimate goal is to empower every person and every organization on the planet to achieve more. Almost every choice and practice I have been involved with since starting has incorporated this goal. It is important to understand the user because they ultimately drive the industry.", "_subject": "Submission to the SEED Project", "title_name": "Technical Account Manager"}, {"copyedit": "on", "name": "Kara King", "web_site": "https://www.linkedin.com/in/kara-king-b245a259", "question_challenge": "The greatest challenge I face being a developer at FirstEnergy is communication with our business. Being a developer you must take business requirements and turn them into code, however, many times the  business clients do not even know themselves what they want in their desired product. ", "time": "15", "_format": "plain", "question_advice": "Networking is a huge advantage when searching for a job. I still network in my job now in case I have a desire to test the waters in a different part of my company. Also, take advantage of internships they get your foot in the door.", "company_name": "FirstEnergy", "question_fact": "FirstEnergy has such a wide rage of jobs and IT comprises of over 3 different development languages so there are areas to learn and grow in. I use ABAP, advanced business application programming. ABAP is the language for SAP and is written in German, so if you know German, ABAP may be the development language for you.", "_subject": "Submission to the SEED Project", "title_name": "SAP developer"}, {"copyedit": "on", "name": "Jonathan Cilley", "web_site": "http://www.hvfcu.org", "question_challenge": "The biggest challenge I face on a daily basis is scope management for our projects that we undertake internally. Scope creep is a real threat to the successful completion of programming projects. If project scope is not managed properly it may delay your project significantly causing customer relationship management problems. Worse yet you may launch with features that are so flawed due to a shotgun approach to development that you can never recover your reputation as a developer or organization. \r\n\r\nThe ways you mitigate this scope creep risk is by being at least somewhat versed in project management as a developer and by mastering the art of the soft \"no.\" Being able to say no to a request but putting it in a way that is less off-putting to a stakeholder is the only way that you can get out of these types of difficult conversations without causing friction within project teams.", "time": "20", "_format": "plain", "question_advice": "The one piece of advice that I would give anyone entering the software programming or engineering field is that in order to be truly successful you must not only be strong technically but you must also develop your soft skills so you can communicate to your stakeholders. Technical skills without the ability to translate what users want or need through strong communication means that you will not be nearly as successful in your career. Not having strong communication skills will also keep you from advancing to management positions within an organization.", "company_name": "Hudson Valley Federal Credit Union", "advancecopy": "on", "question_fact": "One of the most fun parts of my role at Hudson Valley FCU is that I get to be involved in so many great projects and push the organization to innovate beyond what they have traditionally done. Currently I am working on building a custom API interface to a knowledge management platform called Mindtouch. What makes this project so great is that it allows me to bring together working with modern web standards while also exercising my object oriented skills with the C# language to integrate our internal systems with a complex 3rd party platform.", "_subject": "Submission to the SEED Project", "title_name": "Vice President of Information Technology"}, {"copyedit": "on", "name": "Brian Blose", "web_site": "https://www.linkedin.com/in/brian-blose-2545871a/", "question_challenge": "Requirements gathering is consistently the most challenging aspect in software development for me.  Some of this can be offloaded onto a business analyst if you're fortunate to have one on your project, but often you need to sit down with the people who will use your software (not their boss or the director of their department) and learn how they do their job in order to shake out important details.  The alternative is hacking together a series of emergency fixes to account for the incomplete specs.", "time": "15", "_format": "plain", "question_advice": "No one expects the new developer to be an immediate star in the corporate world.  Obtaining your CS degree is a huge accomplishment, but there is so much more to learn -- some of which will be unique to the organization that employs you.  If you are not formally provided a mentor, then identify someone knowledgeable and personable enough on your team to answer questions and provide advice.", "company_name": "Giant Eagle", "question_fact": "While most wouldn't expect it of a regional grocery chain, Giant Eagle is one of the larger IT employers in Pittsburgh.  This is mostly due to the company philosophy of building software in house instead of buying commercial off the shelf products.  Giant Eagle's pharmacy pushes approximately a third of prescriptions chain-wide to a central processing facility where robotic systems dispense pills into bottles, then drop it to an assembly line for workers to package and ship to individual pharmacies.  I have the fortune (and occasionally dismay) of building and maintaining interfaces between the software of this facility and our store systems.", "_subject": "Submission to the SEED Project", "title_name": "Software Developer"}, {"name": "Yashu", "web_site": "https://www.linkedin.com/in/yashu-ahuja-0597322a/", "question_challenge": "The challenge is work-life balance.", "time": "5", "_format": "plain", "question_advice": "If you are totally inclined towards learning new stuff and have a passion for programming, ONLY THEN enter the field", "company_name": "Nagarro Software Private Limited", "advancecopy": "on", "question_fact": "I get to meet new people, and learn a lot of new things upcoming in the IT sector. ", "_subject": "Submission to the SEED Project", "title_name": "Senior Associate"}, {"name": "Arpan Agrawal", "web_site": "https://www.linkedin.com/in/arpanagr/", "question_challenge": "Interacting with hardware", "company_name": "Greyorange Robotics", "question_advice": "Be thorough about what you do", "question_fact": "New Technology", "time": "2", "_format": "plain", "_subject": "Submission to the SEED Project", "title_name": "Technical Architect"}, {"copyedit": "on", "name": "Anna Griffith", "web_site": "http://www.discoverymachine.com/", "question_challenge": "Communicating with people.", "time": "3", "_format": "plain", "question_advice": "Relationships are important.", "company_name": "Discovery Machine", "advancecopy": "on", "question_fact": "We work with interesting and dynamic people on new challenges every day.", "_subject": "Submission to the SEED Project", "title_name": "ceo"}, {"copyedit": "on", "name": "Patrick Canella", "web_site": "http://patcanella.com", "question_challenge": "Definitely figuring out the \"right\" way to build a new feature or refactor code. There are a ton of situations where you feel like it's an \"easy fix\" and it'll take you an hour or so to do, but due to the complexity of the code, there's always an \"easy way\" and a \"right way\" to do things, and I think that's a great challenge in itself. ", "time": "5", "_format": "plain", "question_advice": "I would say that being an engineer is much more than writing good code; you need to have a good deal of soft skills as well to properly shape your career. Things like the ability to take criticism, always having a learning attitude and knowing how to listen to others' ideas and not immediately discount them are all incredibly useful to grow as both an engineer and a person. ", "company_name": "ebay inc", "advancecopy": "on", "question_fact": "Currently, we are in the process of switching over from our old Java stack to NodeJS on the Front End! We are doing this for better parity when it comes to code writing and code sharing amongst our team and teams outside of our department.", "_subject": "Submission to the SEED Project", "title_name": "Software Engineer - Front End"}, {"copyedit": "on", "name": "Keegan Shudy", "web_site": "https://www.linkedin.com/in/keegan-shudy-b2a9b998/", "question_challenge": "In order for the product I work on to succeed the engineers that I work with have to understand Azure from an end to end perspective. Most people (in any industry) need to understand how their own service works along with maybe a few others if they want to connect with outside products. As an example if I want to build a website, I just need to know how my site works, I do not need to know how the web browser navigates to my site, just that my site works once it gets there. \r\n\r\nKnowing what your service does, but also how it interacts with different layers inside of Azure. In addition to other questions: how do you build geo redundancy, reduce single points of failure, scale to multiple regions around the world, testing at scale, security and authorization with sensitive data. These are problems that three companies around the world try and solve (Microsoft included) and are included in my greatest challenges", "time": "5", "_format": "plain", "question_advice": "Gather knowledge of what field you want to go into exactly (Single point applications, Distributed Applications, etc.). Computer science is now a larger field than ever, to say \"I want to code\" is becoming more and more generic each day.", "company_name": "Microsoft", "advancecopy": "on", "question_fact": "Cloud operations at Microsoft is a multi-billion dollar industry capturing people from all over the world and from many different markets ranging from cancer detection, to apps that help kids with homework. ", "_subject": "Submission to the SEED Project", "title_name": "Software Engineer I"}, {"copyedit": "on", "name": "Tony Borres", "web_site": "http://www.tonyborres.com", "question_challenge": "The greatest challenge of web and mobile technologies, especially front-end web technologies, is keeping up with the ever changing technical landscape. Back-end technologies like C, C#, Ruby, etc. may introduce new features fairly regularly, but they remain fairly consistent over the years. Front-end frameworks and patterns, on the other hand, can change every six months. That's part of what makes the field exciting, but it is a challenge for both novice and experienced developers to keep up. I honestly give credit to Allegheny's Programming Language Concepts course when discussing how difficult the changing landscape can be with my co-workers. The course did a great job of instilling in me how important it is to understand programming concepts rather than specific language syntax and implementation.", "time": "45", "_format": "plain", "question_advice": "Never be too embarrassed about what you don't know to ask somebody who might know. There's too many languages, patterns, and techniques out there to know everything, and the sea of potential knowledge keeps growing. ", "company_name": "Base Two", "advancecopy": "on", "question_fact": "Base Two is an Allegheny graduate owned full-stack web and mobile software consulting company. We work with clients big and small - from a Fortune 500 power company to a digital-based chore and allowance management app for children.", "_subject": "Submission to the SEED Project", "title_name": "Developer"}, {"copyedit": "on", "name": "Ryan Cambier", "web_site": "https://www.linkedin.com/in/ryan-cambier-a3a6b969", "question_challenge": "Translating the business requirements into new functionality for the script (program). This involves making sure the automated script represents a normal human filling out the website and exhaustively testing all possible avenues the site can take when navigating through the policy-making (or policy-editing) process.", "time": "20", "_format": "plain", "question_advice": "Learn how to be patient and personable when talking with colleagues, a big thing that separates a good worker from a great worker is being easy to get along with, especially in stressful working conditions (also known as \"crunchtime\")", "company_name": "AmTrust Financial", "question_fact": "Fast growing insurance company, based in New York City, that is rank #1333 on Forbes (#1495 in 2016). I currently maintain an automated script that tests the robustness and functionality of a website that creates insurance policies and edits the policies in various ways. I have seen insurance policies covering a 'Yurt' house and volcano insurance for certain buildings.\r\n\r\nThey have provided free tickets and reserved an entire theater for both of the recent Star Wars movies (along with free food from the Barrio food truck, incredible tacos)", "_subject": "Submission to the SEED Project", "title_name": "Software Engineer In Test"}, {"copyedit": "on", "name": "Eric Engelhardt", "web_site": "https://remindermedia.com", "question_challenge": "Users. Users that aren't technically savy always have trouble understanding when things are wrong. They don't get that the computer isn't the problem and that it worked exactly how it was supposed to. ", "time": "5", "_format": "plain", "question_advice": "Keep an open mind to new technologies. Just because you haven't seen it before doesn't mean it's bad. This will help you succeed because management can always trust you to give an honest review. ", "company_name": "ReminderMedia", "advancecopy": "on", "question_fact": "The company provides free snacks everyday!", "_subject": "Submission to the SEED Project", "title_name": "System Administrator"}, {"copyedit": "on", "name": "Jesse Hixson", "web_site": "https://www.linkedin.com/in/jesse-hixson-396a212b/", "question_challenge": "There is a constant balance of delivering quality software within a given time frame. Sometimes it becomes necessary to make concessions in order to meet deadlines or business requirements. \r\n\r\nBeing able to plan effectively and determine the most important deliverables have become crucial parts of my development process.", "time": "30", "_format": "plain", "question_advice": "Never stop learning and be humble. Software development is as much of an art and craft as painting or sculpting. It takes time, effort, and experience to become truly skilled.\r\n\r\nAlso never turn down the chance to learn from those who have come before you, and be willing to give back to those who come after you.", "company_name": "Carney", "advancecopy": "on", "question_fact": "I work for an advertising agency so I get to take on a wide variety of projects. I enjoy the fast pace and the ability to come up with creative solutions for our clients.\r\n\r\nMy favorite aspect is being able to help our clients reach their business goals while learning about and taking advantage of some cutting-edge tools and frameworks.", "_subject": "Submission to the SEED Project", "title_name": "Technical Director"}, {"copyedit": "on", "name": "Suvarshi Bhadra", "web_site": "https://www.linkedin.com/in/sbhadra/", "question_challenge": "In this field, the learning never stops. There is always more to learn, more to do, and the pace of development can always be improved. So maintaining a balance between work, personal hobbies, and family time is the greatest challenge in this field. ", "time": "10", "_format": "plain", "question_advice": "Build an application from end to end - whether it be a website, mobile app, or a game. This will give you a high-level understanding of how all the pieces fit together. Understanding the big picture can keep one motivated as one dives into the details of networking, databases, or whatever else one is learning.", "company_name": "Facebook", "advancecopy": "on", "question_fact": "Engineers joining Facebook don't have a position or role set aside for them. This was very confusing to me at first. 'Don't they know what they want me to work on?' I wondered. Instead, after a 6-week bootcamp, I was told to pick any team that I wanted from up to 50+ teams across the company! The thinking goes when engineers are working on problems they want to solve the company is more impactful!", "_subject": "Submission to the SEED Project", "title_name": "Software Engineer"}, {"copyedit": "on", "name": "William Yaworsky", "web_site": "https://northamerica.startupbus.com/", "question_challenge": "Managing and coordinating the expectations of teams across several timezones.  Sometimes as an early stage company you have to pivot and change direction on a dime.  Those that are following your leadership need to be cushioned to some degree of they may get wiplash and lose faith in your leadership and direction.", "time": "15", "_format": "plain", "question_advice": "I've got a few,\r\n1) Nothing is impossible\r\n2) You will not grow as a person if you're comfortable\r\n3) Sometimes the best way to gain experience is to have bad judgment", "company_name": "StartupBus", "advancecopy": "on", "question_fact": "Where to begin? Well we take 20-30 hackers, hustlers, and designers and put them onto buses from all over North America for 3 days in an intense simulation of the first 3 months of starting a tech startup.  All buses cumulate at a final destination where we have a 2 day long shark tank style pitch competition.  I could talk at length about the incredible things we do and really can't pick one \"fun fact\" to focus on.", "_subject": "Submission to the SEED Project", "title_name": "North America Director"}, {"copyedit": "on", "name": "Chris Wright", "web_site": "https://www.linkedin.com/in/chrisjameswright/", "question_challenge": "It is always a challenge to decide when an application has been tested \"enough\", as the risk/reward trade-off for doing more testing becomes less clear the more testing you perform.", "time": "15", "_format": "plain", "question_advice": "Always look for cross-functional opportunities, as they allow you to find our more about how people in other roles that fit around yours. The better you understand the whole of the development process, such as user research and user experience design, the more successful you will be as a team - software development is a team sport, not a solo performance.", "company_name": "HMRC", "advancecopy": "on", "question_fact": "For a team developing a digital service, we actually get through a huge number of post-it notes, and probably refer to a physical board for our sprint more than our electronic one.", "_subject": "Submission to the SEED Project", "title_name": "Technical Test Lead"}, {"copyedit": "on", "name": "Karl Yngve Lervåg", "web_site": "http://github.com/lervag/", "question_challenge": "Conservative researchers and developers. In the sense that they don't want to test or try new approaches for developing code, new styles of coding, new languages, and similar. Although it should be mentioned that there are often good reasons for this conservative behaviour. New and shiny is not always better than old and proven.", "time": "20", "_format": "plain", "question_advice": "Listen to advice from seniors in the field, in particular if it feels conservative or constraining. Try to understand why. But also, don't be too afraid to try new things. New methods, new tools, new ideas, new approaches, new programming languages, and similar. If if should turn out to be not so useful, it will still be a good learning experience.", "company_name": "SINTEF Energy Research", "advancecopy": "on", "question_fact": "Working with software development within my fields of research (applied mathematics/computational fluid dynamics/thermodynamics) is interesting, perhaps in particular because most people working in the field are not educated software developers. Thus they often do not know about (or care about) version control, code reviews and other essential tools and software developer cultures.", "_subject": "Submission to the SEED Project", "title_name": "Research Scientist"}, {"copyedit": "on", "name": "Ramin Keene", "web_site": "https://www.linkedin.com/in/raminkeene/", "question_challenge": "Finding our addressable market and bringing the value of our product to them", "time": "5", "_format": "plain", "question_advice": "you MUST be a lifelong learner and motivated to constantly challenge and push yourself out of your comfort zone to keep growing and keeping your experience relevant.", "company_name": "Startup", "advancecopy": "on", "question_fact": "We're bringing some quite advanced distributed systems theory into as simple of a mainstream dev workflow tool as we can.", "_subject": "Submission to the SEED Project", "title_name": "Founder"}, {"copyedit": "on", "name": "Rebecca Dilla", "web_site": "https://www.linkedin.com/in/rebecca-dilla-ab174974/", "question_challenge": "There are never enough hours in the day to make the product you would love to make! In school, your work is done when you turn your project in. The product is never \"done\". It's continually being fixed, grown, and improved. ", "time": "15", "_format": "plain", "question_advice": "Don't just look at the big companies when you're looking for a job. Ask around, talk to people. Often, there are so many benefits to working for a smaller company, and a bigger chance to make an impact. The downside it that their harder to find- this is where networking comes in so handy. Invite an acquaintance in the field out to coffee to ask them a few questions. If you don't have any, reach out to some people you've found online. It's scary, but it'll give you better insight and teach out about opportunities you never knew existed. ", "company_name": "Niche.com", "advancecopy": "on", "question_fact": "My company is tiny, but powerful! We've only got about 30 people in our office, but we get a lot work done- and have good time together! Niche has a great work/life balance. We have a soccer team, breakfast club, a reading club... We love making our product, but realize that what you do from 9-5 isn't the most important part of your life. ", "_subject": "Submission to the SEED Project", "title_name": "Product Analyst"}, {"copyedit": "on", "name": "Mark Fenner", "web_site": "http://drsfenner.org/blog", "question_challenge": "In many ways, my challenges are the same as those faced by many technical people when they enter the business world:  communicating, negotiating, estimating, and reporting on the \"adjunct\" tasks of my technical work.  Yes, indeed, when you involve people and finances, the complicating factors grow quickly!", "time": "20", "_format": "plain", "question_advice": "[This is gear primarily to folks coming to my field from a traditional computer science background.]  You can't know enough mathematics.  You can't know enough about the business world (from managing time, money, and people to promoting you and your team and your project).  You can't develop enough interpersonal skills:  listening, communicating clearly (written and spoken, spontaneous and planned), patience, humility, and leadership (by which I mean forging ahead in the face of adversity).", "company_name": "Fenner Training and Consulting, LLC", "advancecopy": "on", "question_fact": "I get all of the fun of being a professor (working with students, building new courses, research new topics - sometimes practical, sometimes \"academic\") without any of the security (100% contract based work).", "_subject": "Submission to the SEED Project", "title_name": "Sole Proprietor and Data Scientist"}, {"copyedit": "on", "name": "Len Bass", "web_site": "https://www.linkedin.com/in/len-bass-7198169/", "question_challenge": "Keeping up with the changes in the field", "time": "5", "_format": "plain", "question_advice": "Learn how to teach yourself things. There are always new things and learning about them is important. At the same time, do not get distracted with the latest buzz word.", "company_name": "Carnegie Mellon Univ", "question_fact": "I currently am learning about blockchains.", "_subject": "Submission to the SEED Project", "title_name": "Adjunct"}, {"copyedit": "on", "name": "SJ Guillaume", "web_site": "https://www.linkedin.com/in/sj-guillaume-3b70328b", "question_challenge": "Keeping up.  There is a monstrous amount of existing software, it takes time to wrap your head around everything.  For example, to understand what I need to change in order to make a bug fix could take me an hour.  It could just as easily take another member of my team twenty minutes either because they wrote the original code or because they have made bug fixes on that part of the code before. ", "time": "25", "_format": "plain", "question_advice": "Invest in learning about the people on your team and how to communicate effectively with them.  We develop software in teams so we can build and fix things quickly.  But if you aren't communicating with your teammates to ask or offer help then you're neither taking advantage of nor contributing to the collective knowledge.  \r\nWhen you start working with a new person ask them \"What is the best way I can communicate with you to ask questions?\".  They may say to come over to their desk at any point to ask a question, or they may ask you to message them your question so their focus isn't interrupted.  ", "company_name": "Priceline.com", "advancecopy": "on", "question_fact": "I work at Priceline.com which is an online travel agency.  You may know of our commercials with William Shatner as the \"Priceline Negotiator\".\r\n\r\nI work on the Rental Car Services team, where I do backend development which ranges from bug fixes to creating new functionalities for our software.  ", "_subject": "Submission to the SEED Project", "title_name": "Associate Software Engineer"}, {"name": "Aarti Sethiya", "web_site": "https://www.linkedin.com/in/aarti-sethiya-82215037/", "question_challenge": "Learning basics and new skills when I was allocated a new project", "company_name": "Adobe", "question_advice": "Everything is possible, only thibg required is your passion for work and inquisitive nature to learn new things", "question_fact": "Team Parties and Activities", "time": "5", "_format": "plain", "_subject": "Submission to the SEED Project", "title_name": "Senior Software Engineer"}, {"copyedit": "on", "name": "Timothy Tsai", "web_site": "https://www.linkedin.com/in/timothy-tsai-6501ba2/", "question_challenge": "Finding out how things are implemented.  This includes (1) finding the right experts who also happen to have spare time and (2) having access to a search engine (internet and intranet) that actually finds pertinent resources.", "time": "15", "_format": "plain", "question_advice": "Try to understand the landscape of the projects that you are working on beyond just the expertise needed for those specific projects.  Try to think about new ideas and extensions.  This striving for new ideas will make those projects better, increase your understanding and experience, garner notice from your bosses, and make your career an interesting endeavor instead of merely a way to make a living.", "company_name": "Nvidia", "question_fact": "As with many successful companies, Nvidia has undergone several transformations in its focus.  Originally it produced chips for graphics processing.  It then formalized the functionality and interface to the graphics hardware and software to invent the GPU.  After several years, GPUs started being used for efficient parallel processing for supercomputers.  In the last few years, the world realized that GPUs offered a practical mix of parallel processing units and memory bandwidth that enabled efficient deep neural net (DNN) implementations.  So, in 25 years, Nvidia has transformed from a graphics company to also being a company that powers self-driving cars.", "_subject": "Submission to the SEED Project", "title_name": "Senior Research Scientist"}, {"copyedit": "on", "name": "Kimberly Madia", "web_site": "http://indsci.com", "question_challenge": "Going faster to deliver new products, especially ones that are simple.  Software will not get used unless the user experience is second to none.", "time": "3", "_format": "plain", "question_advice": "Always be learning new technologies and build products around customer pains, get the end user involved with software requirements early and often", "company_name": "Industrial Scientific", "question_fact": "We are dedicated to ending death on the job by 2050", "_subject": "Submission to the SEED Project", "title_name": "Director, Product Management, Cloud Services"}, {"copyedit": "on", "name": "Vahid Azamtarrahian", "web_site": "http://www.vahidazam.com", "question_challenge": "Keeping up with technology. You'll soon realize that after undergrad that there is always more to learn about the field and technology is always changing. You won't always use the latest and greatest technology at your job, but if you want to grow as a professional programmer, you will continue to learn.\r\n\r\nWorking on outside projects outside of working hours is a great way to experiment with new technology and to refresh your enjoyment of programming. Most professional developers may be working on a project they don't find that fulfilling on the day to day, but having a side project allows you the freedom to experiment and grow as a developer and work on something you find interesting and fulfilling.\r\n\r\nAlso, one thing I found surprising is that you do very little new development as a professional. Unless you are working early-on at a startup or you are working on a new project, most professional developers will be working in pre-existing code bases. These can be very large code bases where you are only working on one small part of it. You'll be expected to read other people's code regularly and add onto that code while following standards setup by the organization (or no standards which leads to headaches). As you grow as a developer and professional and gain more experience, you'll realize why you love standards!\r\n\r\nAlso, when you start a new job, you are definitely going to find there are bad programming practices being used and hacks and what not. Choose your battles. Do not go into a new company telling them how everything they have done is wrong. Do the best you can without annoying everyone at the company. Sometimes there is a reason for the way something was done. If it's that bad, get your experience points and start looking for a new job. Spend your energy learning good coding practices outside of that company instead of constantly arguing at work. Most companies can be set in their way of doing things.", "time": "20", "_format": "plain", "question_advice": "I highly recommend working on a small side project that utilizes multiple technologies to build up your understanding of professional development end to end. For example, try building a small web application which will build your knowledge on systems administration, web hosting, HTTP stack, databases, back end programming, and front-end programming. I would also make sure to take a database class if possible because of the prevalence of databases in the professional world. I didn't take a database class at Allegheny, and I regret it. It can take a little bit of time to wrap your head around relational databases and the methodology as well as the functional programming paradigm of SQL.\r\n\r\nAlso, if you can, learn GIT as soon as possible. Learning how to use a version control system is extremely important when working professionally and the earlier you start working with it and understanding it, the better you'll be able to integrate yourself into a professional team. Companies love candidates that have a Github account setup with code to show in them.", "company_name": "Dewpoint Inc", "advancecopy": "on", "question_fact": "I currently write a number of web applications for my company. The greatest part of the job is knowing how many people use the web applications we write and how our work is making their lives easier or better.\r\n\r\nA current project I'm working on helps provide HIV medication to residents in Michigan that are in need of the drugs and cannot financially afford them. They use our web application to apply for assistance to the drugs and renew their subscription on a semi-annual basis. Knowing that we are providing assistance to people in need in Michigan provides a great sense of accomplishment and pride for me.", "_subject": "Submission to the SEED Project", "title_name": "Application Developer"}, {"copyedit": "on", "name": "Kristen Walcott-Justice", "web_site": "http://cs.uccs.edu/~kjustice", "question_challenge": "I think the biggest challenge is in balancing teaching and research.  Research needs to be largely self motivated whereas teaching requires constant attention given firm deadlines and student needs.  Within both areas, your teaching and research constantly needs to evolve.  You need to follow the new technologies, languages, software engineering tools, etc  in addition to the research in those areas.  It can become very overwhelming.  ", "time": "5", "_format": "plain", "question_advice": "Learn to organize, prioritize, and stick to a schedule.  Also, learn to say no.  You can't do everything.  Remember your goals and priorities in all you do.  ", "company_name": "University of Colorado Colorado Springs", "question_fact": "It is extremely exciting to teach and to work with students to build and research new software testing tools.  You never know what will happen!  In a recent research project on security in IoT, we learned the extreme need for care in experiment setup.  My student intended that hackers only attack his simulated IoT network- maybe get into other parts of the machine as well.  However, one night his home wireless printer started spewing blank pages of paper in the middle of the night.  I still think his house is haunted... but it was actually a telnet attack that escaped from his honey pot environment.  ", "_subject": "Submission to the SEED Project", "title_name": "Assistant Professor"}, {"copyedit": "on", "name": "James Klein ", "web_site": "http://www.northrupgrumman.com", "question_challenge": "The greatest challenge is changing the culture and how people think. Even if you have a new solution that's innovative and saves time and money, if it looks or feels different people will fight it.", "time": "5", "_format": "plain", "question_advice": "Stay positive and have a good attitude! If you're the smartest person there, but hard to work with your efforts go to waste. Even if you're the dumbest person there if you're good to work with you can be the most valuable person. ", "company_name": "Northrop Grumman ", "question_fact": "Northrop Grumman has a wide variety of different work across the US and world for all sorts of candidates.", "_subject": "Submission to the SEED Project", "title_name": "Computer Systems Architect "}, {"copyedit": "on", "name": "Brandon Ginoza", "web_site": "https://www.linkedin.com/in/ginozab/", "question_challenge": "The greatest challenge that I have faced when working at MMC was probably learning the complexity of the medical system such as jargon, rules and regulations, software, etc. ", "time": "5", "_format": "plain", "question_advice": "I would say go out and do internships to get work experience that you can talk about with future employers. ", "company_name": "Meadville Medical Center", "question_fact": "MMC is a non profit hospital, I didn't realize that until I started researching MMC for my interview a year ago. ", "_subject": "Submission to the SEED Project", "title_name": "Interface Analyst"}, {"copyedit": "on", "name": " Ben Matson", "web_site": "https://www.linkedin.com/in/ben-matson-49911143/", "question_challenge": "The greatest challenge I face with my job is the soft skills that were neglected through college. While I was taught the hard skills (logicists and programming languages) and getting homework assignments complete, I developed some bad habits that have been dragging me down. For example, thinking problems multiple steps ahead, asking the right questions, debugging practices, and a few others have certainly changed my perspective of the software engineering field.", "time": "15", "_format": "plain", "question_advice": "I highly recommend getting an internship with a small company to start building your experience. The reason I recommend a small company is so that you have more opportunities to broaden your skill set besides programming and problem solving. In my experience, coming out of college with a small handful of experiences have helped me get my foot in the door but had I pursued more internships for longer periods of time would have  payed off immensely in the long run. College helps keep you rounded and open minded but does not give you enough time in the field that you are going into.", "company_name": "ClikFocus", "advancecopy": "on", "question_fact": "I'm currently working on a website project dedicated to helping kids between the ages of 13 and 18 start peace movements through the use of the internet. This site is being developed on the Drupal 8 platform with plenty of tools for young users to start and create projects of their own to make the world a better place.", "_subject": "Submission to the SEED Project", "title_name": "Junior Drupal Developer"}, {"copyedit": "on", "name": "Colton Shibe", "web_site": "https://www.linkedin.com/in/colton-shibe", "question_challenge": "The learning curve from writing code that just works in school to creating full blown working enterprise applications that thousands of people will be using. ", "time": "5", "_format": "plain", "question_advice": "Keep working hard to understand design patterns and good practices. And, don't forget to comment your code!", "company_name": "Lockheed Martin", "advancecopy": "on", "question_fact": "Lockheed Martin is an awesome place to work! They are currently revamping the work place to create a more open and inclusive environment. Many projects have moved from the traditional cubical setup to an agile bullpen setup.  ", "_subject": "Submission to the SEED Project", "title_name": "Software Engineer"}, {"copyedit": "on", "name": "Vanida", "web_site": "https://www.linkedin.com/in/vanidavisessung/", "question_challenge": "The ever-changing requests/restraints given are tough when they are abruptly given.", "time": "5", "_format": "plain", "question_advice": "Be intuitive with how you go about your tasks and evaluate what you're doing each step of the way.", "company_name": "Raytheon", "advancecopy": "on", "question_fact": "A current project I am working on deals with live monitoring of the chemical levels of water in a certain environment using a microcontroller.", "_subject": "Submission to the SEED Project", "title_name": "Software Engineer"}, {"copyedit": "on", "name": "Jennifer Haddox-Schatz", "web_site": "https://www.linkedin.com/in/jennifer-haddox-schatz-75b8aa8", "question_challenge": "A big challenge we face is working with software systems that are decades-old and upgrading and maintaining this software. Although our employees tend to come to Wagner and stay, turnover at other larger organizations with whom we work on extended projects is also a challenge.", "time": "20", "_format": "plain", "question_advice": "Learn to write software that is capable of going the distance - namely software that can be maintained by you AND others over not just a period of months, but years. This may mean spending more time on creating readable, understandable code and  good documentation than simply on creating code that \"works\". Further, never underestimate the power of others to use software that you wrote in ways you never imagined - and keep this in mind when writing error handling code! Always be prepared with a plan to demonstrate that your software is behaving according to specification, and remember that good logging can go a long way towards helping with this.", "company_name": "Daniel H. Wagner Associates, Inc.", "advancecopy": "on", "question_fact": " In many ways our company is an extension of some of the best parts of the academic environment. We are given a wide degree of flexibility of when and where we do our work - the important thing is that the work is done, and done well.  In fact , some of my colleagues at times are night owls who seem to be at their most productive at three in the morning! We also have the option to come to work in a student-like wardrobe (excluding when we are at client sites, of course !) But in addition to that and working with a wonderful group of talented people, we get our own private offices, adjustable/ergonomic workstations,  and great compensation/benefits.", "_subject": "Submission to the SEED Project", "title_name": "Associate"}, {"copyedit": "on", "name": "Glenn Buckholz", "web_site": "http://www.coveros.com", "question_challenge": "Solving technical problems in the time allotted and communicating the impact of that solution to the people in charge who are typically non technical users. I have been in the field for 17 years and I have never been on a project where the budget matched the effort being undertaken. Figuring out which technical compromises to make so that \"something\" can be demonstrated without dooming the future viability of the project is an art. Communication of the solution you just created to the non-technical users that funded the project is also an issue. Making them understand that even though you demoed a working piece of software, they still have to pay to fix things, is a difficult sell. ", "time": "20", "_format": "plain", "question_advice": "Do not be consumed by the shiny baubles of \"new\" technologies. They are all based on concepts and theories that have been around for decades or centuries (if the solution is more mathematical in nature). Be able to evaluate each technology based on the merits of how it helps you solve the problem at hand and not how new it is. To do that you need a deep understanding of how it was made. The classic example is the emacs vs. vi war in our field. In truth, I use both based on what problems I'm solving. Don't discount possible solutions based on some imaginary bias stated as fact on social media or marketing literature. Learn it yourself and know. When your competition is trying to pound the square peg into the round hole based on a facebook post, you've already delivered a working solution based on old technology. How fast you delivered and how well it works are what you will be graded, the how is often left in your hands. ", "company_name": "Coveros", "question_fact": "There is very little management were you to compare us to a traditionally structured company of the same size. We engage in mentoring and rely on self direction. Many older organizations fear this model and are confused as to how we get anything done. :)", "_subject": "Submission to the SEED Project", "title_name": "Technical Manager"}, {"copyedit": "on", "name": "Reed Dunkle", "web_site": "https://www.linkedin.com/in/reeddunkle/", "question_challenge": "The greatest challenge I face in building software is making it maintainable and extensible. Rich Hickey in his talk \"Simple Made Easy\" talks about this at length. It's easy to add methods to my objects, but it's hard to appreciate the complexity that I'm incidentally building into the program. It's easy to focus on my experience writing the code, but it's hard to understand the experience future developers will have maintaining and extending my code.", "time": "120", "_format": "plain", "question_advice": "My advice is to understand your role in influencing the field. This is true for any field, but it's especially true for newer, less-developed fields like Computer Science. Never swallow the line \"this is way it's always been done\". Always be on the lookout for a better way. Progress is made by challenging the status quo. As a young programmer, you're less beholden to tradition. You should see it as your duty, indeed it's part of the reason you'll be hired -- or it should have been part of the reason you'll be hired -- to show the industry new and better ways. I argue that research and experimentation is part of your responsibility as an engineer.", "company_name": "Base Two", "advancecopy": "on", "question_fact": "My company has nine employees including our current apprentice. We build custom software for clients. As a team, we have different levels of experience in different areas, but our founder, Drew Miller (Allegheny '05), has structured the company more like partners in a law firm, as opposed to a more traditional hierarchy of positions. This does away with seniority, and gives each of us more agency and more responsibility.\r\n\r\nWe're all programmers, so we end up having to step into non-programming roles as the needs arise, such as business development, and project management. This is especially true internally, as we share responsibility in shaping the future of our company, and creating its health and prosperity.\r\n\r\nI think it's interesting the way this sort of company model enables us to be more agile as compared to the more traditional, bureaucratic model. Our small company size shelters us from a lot of the bureaucratic layers. The end result, though, is that we're able to more easily experiment as a company. We can examine ourselves, and make adjustments quickly. And we can iterate through experimental processes, refining them and working out bugs.\r\n\r\nThis isn't a new idea, of course. Paul Graham has written about this since at least 2004, and lots of non-tech companies have implemented something similar. But it's still enough of a novel idea to warrant writing about. When Drew founded the company six years ago, the model was that much more contrarian.\r\n\r\nFor me, the most fun fact about all of this is that Drew made it happen. He did the hard work of putting the philosophies into practice, of building a company which stands as a case study and as a success story. If more businesses form around this model, and other businesses strive to adopt this model going into the future, it's in part because of our contribution to this larger conversation, and our example as a way to make it work.", "_subject": "Submission to the SEED Project", "title_name": "Software Developer"}, {"copyedit": "on", "name": "Justin Zymbaluk", "web_site": "https://www.linkedin.com/in/justinzymbaluk/", "question_challenge": "As a new software engineer, there's a lot of technologies to get familiar with that can't be taught in school. Being able to catch up with, and stay abreast of, new technologies in such a rapidly changing industry is a huge challenge", "time": "10", "_format": "plain", "question_advice": "Get yourself a degree and don't shy away from theory! I hear people say that they will \"never use\" some theoretical CS concepts in the real world, but the truth is that being familiar with the theory allows you to be much more effective in an industry where there is so much abstraction. Having a firm grasp of computer science theory is what seperates coders from software engineers.", "company_name": "MITRE Corporation", "advancecopy": "on", "question_fact": "MITRE is a non profit company that runs FFRDC's - Federally Funded Research and Development Companies - they provide guidance on engineering and science to federal agencies", "_subject": "Submission to the SEED Project", "title_name": "Data Performance Engineer"}, {"copyedit": "on", "name": "Colton McCurdy", "web_site": "http://www.coltonmccurdy.com", "question_challenge": "There are three main challenges that I face daily. First, requirements are never as clear as they are in school. Often what someone actually wants is not at all what they described or wrote down and at my company, the person defining what needs done tells my team leader who then tells me, so information gets lost. Second, you will rarely create something that will be run in one environment or on your local machine and not be part of a larger system. Finally, you will never understand everything in great detail. ", "time": "15", "_format": "plain", "question_advice": "First of all, be passionate and love what you do. Second, always try to learn new things that you can apply to your work. Finally, become part of a community and go to conferences. Always think about how to make yourself marketable for your next endeavor.", "company_name": "StockX", "advancecopy": "on", "question_fact": "We use cool technologies that you are familiar with like Git and Slack, as well as other respected technologies in the startup scene such as Golang, Docker and Kubernetes", "_subject": "Submission to the SEED Project", "title_name": "Software Engineer"}, {"copyedit": "on", "name": "Eric Kapfhammer", "web_site": "https://www.linkedin.com/in/eric-kapfhammer/", "question_challenge": "Easily, the greatest challenge is how to process enormous amounts of data, in a timely manner, and in a robust operational setting. ", "time": "6", "_format": "plain", "question_advice": "Invest the time and effort to learn and study algorithms. This is an important facet of whichever area you plan to specialize in - from data science and machine learning, to software and systems engineering. ", "company_name": "Microsoft", "question_fact": "By using a vectorized function call, I was able to help a colleague bring the daily runtime of a forecasting process down from 19 hours to less than 1 minute.", "_subject": "Submission to the SEED Project", "title_name": "Senior Data Scientist"}]
